#ifndef _XML_PARSER_HPP_
#define _XML_PARSER_HPP_

/** ****************************************************************************
 * @brief Парсер xml файлов, описывающих состояния кодера.
 * @file xml_parser.hpp
 * @author Петров А.С.
 * ****************************************************************************/

/* --- Подключение заголовочных файлов -------------------------------------- */

// Стандартная библиотека
#include <string> // Строки

// Файлы проекта
#include "coder_descr_iface.hpp" // Абстрактный интерфейс парсера

namespace nsViterbiCoder
{

/** ****************************************************************************
 * @brief XML парсер..
 * @class cXmlParser
 * ****************************************************************************/
class cXmlParser : public cCoderDescrIface
{

    /* --- Конструкторы/деструкторы ----------------------------------------- */
public:

    /// @todo Исключения...

    /** ************************************************************************
     * @brief Конструктор.
     * @param [in] fileXmlName Путь до файла с xml описанием состоний кодера.
     * ************************************************************************/
    explicit cXmlParser( const std::string &fileXmlName );

    /** ************************************************************************
     * @brief Деструктор.
     * ************************************************************************/
    ~cXmlParser();

    /* --- Реализация интерфейса cCoderDescrIface --------------------------- */
public:
    virtual bitCount_t getOutBitCount() override;
    virtual table_t createTable() override;
};



} // nsViterbiCoder

#endif // _XML_PARSER_HPP_
