#ifndef _CODER_TYPES_HPP_
#define _CODER_TYPES_HPP_

/** ****************************************************************************
 * @brief Типы данных кодера.
 * @file coder_types.hpp
 * @author Петров А.С.
 * ****************************************************************************/

/* --- Подключение заголовочных файлов -------------------------------------- */

// Стандартная библиотека
#include <cstdint> // Определения целочисленных типов
#include <map> // Отображение
#include <array> // Массив

namespace nsViterbiCoder
{
/** ****************************************************************************
 * @brief Количество выходных бит.
 * ****************************************************************************/
using bitCount_t = std::size_t;

/** ****************************************************************************
 * @brief Состояние кодера.
 * @details Описание состояния каждого элемента кодера.
 * ****************************************************************************/
using state_t = unsigned;

/** ****************************************************************************
 * @brief Выходное значение.
 * ****************************************************************************/
using value_t = unsigned;

/** ****************************************************************************
 * @brief Состояние кодера при воздействии (ввод данных).
 * @struct sCoderStateDescr
 * ****************************************************************************/
struct sCoderStateDescr
{
    /** ************************************************************************
     * @brief Следующее состояние.
     * ************************************************************************/
    state_t mNextState;

    /** ************************************************************************
     * @brief Выходное значение.
     * ************************************************************************/
    value_t mOutValue;
};

/** ****************************************************************************
 * @brief Количество возможных входных значений.
 * @details 0/1.
 * ****************************************************************************/
constexpr static unsigned COUNT_INP_VAL{ 2 };

/** ****************************************************************************
 * @brief Идентификатор таблицы.
 * ****************************************************************************/
using id_t = unsigned;

/** ****************************************************************************
 * @brief Таблица, описывающая состояния кодера.
 * @details Ключ мапы: @todo
 * ****************************************************************************/
using table_t = std::map< id_t, std::array< sCoderStateDescr, COUNT_INP_VAL > >;


}


#endif // _CODER_TYPES_HPP_
