#ifndef _CODER_DESCR_IFACE_HPP_
#define _CODER_DESCR_IFACE_HPP_

/** ****************************************************************************
 * @brief Интерфейс описания кодера.
 * @file coder_descr_iface.hpp
 * @author Петров А.С.
 * ****************************************************************************/

/* --- Подключение заголовочных файлов -------------------------------------- */

// Стандартная библиотека
#include <cstdint> // Определения целочисленных типов

// Файлы проекта
#include "coder_types.hpp" // Типы данных кодера


namespace nsViterbiCoder
{

/** ****************************************************************************
 * @brief Интерфейс описания кодера.
 * @class cCoderDescrIface
 * ****************************************************************************/
class cCoderDescrIface
{
    /* --- Конструкторы/деструкторы ----------------------------------------- */
public:
    /** ************************************************************************
     * @brief Виртуальный деструктор.
     * @details Для корректного освобождения памяти.
     * ************************************************************************/
    virtual ~cCoderDescrIface(){}

    /* --- Интерфейс для наследников ---------------------------------------- */
public:
    /** ************************************************************************
     * @brief Получение количества результирующих бит после кодирования.
     * @return Количество выходных бит при кодировании.
     * ************************************************************************/
    virtual bitCount_t getOutBitCount() = 0;

    /** ************************************************************************
     * @brief Создание таблицы состояний.
     * @return Таблица состояний кодера.
     * ************************************************************************/
    virtual table_t createTable() = 0;
};

}

#endif // _CODER_DESCR_IFACE_HPP_
